OpenROAD 26Q2-1619-g9e1904a6f8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
source /opt/OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
[INFO ODB-0227] LEF file: /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lef/asap7_tech_1x_201209.lef, created 30 layers, 9 vias
[INFO ODB-0227] LEF file: /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lef/asap7sc7p5t_28_R_1x_220121a.lef, created 212 library cells
link_design magic1000_core_orfs
read_sdc ./results/asap7/magic1000/base/1_2_yosys.sdc
source /opt/OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
eliminate_dead_logic
Removed 0 unused instances and 0 unused nets.
write_db ./results/asap7/magic1000/base/1_synth.odb
write_sdc -no_timestamp ./results/asap7/magic1000/base/1_synth.sdc
Elapsed time: 0:02.48[h:]min:sec. CPU time: user 2.27 sys 0.22 (99%). Peak memory: 200384KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
1_synth                   .odb            2            195 3c60e22086d21d8c2c57
1_synth                   .sdc                             ba6aae7560a418cfb7e6
