OpenROAD 26Q2-1619-g9e1904a6f8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
source /opt/OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db ./results/asap7/magic1000/base/3_1_place_gp_skip_io.odb
read_sdc ./results/asap7/magic1000/base/2_floorplan.sdc
source /opt/OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
place_pins -hor_layers M4 -ver_layers M5
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 724
[INFO PPL-0002] Number of I/O             58
[INFO PPL-0003] Number of I/O w/sink      56
[INFO PPL-0004] Number of I/O w/o sink    2
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 411.22 um.
Design area 33 um^2 44% utilization.
write_db ./results/asap7/magic1000/base/3_2_place_iop.odb
Elapsed time: 0:02.68[h:]min:sec. CPU time: user 2.42 sys 0.26 (99%). Peak memory: 198944KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
3_2_place_iop             .odb            2            194 1bf4294cc34120c41f0d
