OpenROAD 26Q2-1619-g9e1904a6f8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
source /opt/OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db ./results/asap7/magic1000/base/3_place.odb
read_sdc ./results/asap7/magic1000/base/3_place.sdc
source /opt/OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
clock_tree_synthesis -sink_clustering_enable -repair_clock_nets
[INFO CTS-0050] Root buffer is BUFx2_ASAP7_75t_R.
[INFO CTS-0051] Sink buffer is BUFx4_ASAP7_75t_R.
[INFO CTS-0052] The following clock buffers will be used for CTS:
                    BUFx2_ASAP7_75t_R
                    BUFx4_ASAP7_75t_R
[INFO CTS-0049] Characterization buffer is BUFx4_ASAP7_75t_R.
[INFO CTS-0007] Net "clk" found for clock "clk".
[INFO CTS-0010]  Clock net "clk" has 30 sinks.
[INFO CTS-0008] TritonCTS found 1 clock nets.
[INFO CTS-0097] Characterization used 2 buffer(s) types.
[INFO CTS-0201] 0 blockages from hard placement blockages and placed macros will be used.
[INFO CTS-0027] Generating H-Tree topology for net clk.
[INFO CTS-0028]  Total number of sinks: 30.
[INFO CTS-0090]  Sinks will be clustered based on buffer max cap.
[INFO CTS-0030]  Number of static layers: 0.
[INFO CTS-0020]  Wire segment unit: 1350  dbu (1 um).
[INFO CTS-0023]  Original sink region: [(5227, 6345), (13348, 13365)].
[INFO CTS-0024]  Normalized sink region: [(3.87185, 4.7), (9.88741, 9.9)].
[INFO CTS-0025]     Width:  6.0156.
[INFO CTS-0026]     Height: 5.2000.
 Level 1
    Direction: Horizontal
    Sinks per sub-region: 15
    Sub-region size: 3.0078 X 5.2000
[INFO CTS-0034]     Segment length (rounded): 1.
 Level 2
    Direction: Vertical
    Sinks per sub-region: 8
    Sub-region size: 3.0078 X 2.6000
[INFO CTS-0034]     Segment length (rounded): 1.
[INFO CTS-0032]  Stop criterion found. Max number of sinks is 15.
[INFO CTS-0035]  Number of sinks covered: 30.
[INFO CTS-0018]     Created 5 clock buffers.
[INFO CTS-0012]     Minimum number of buffers in the clock path: 2.
[INFO CTS-0013]     Maximum number of buffers in the clock path: 2.
[INFO CTS-0015]     Created 5 clock nets.
[INFO CTS-0016]     Fanout distribution for the current clock = 6:1, 7:1, 8:1, 9:1..
[INFO CTS-0017]     Max level of the clock tree: 2.
[INFO CTS-0098] Clock net "clk"
[INFO CTS-0099]  Sinks 33
[INFO CTS-0100]  Leaf buffers 0
[INFO CTS-0101]  Average sink wire length 17.53 um
[INFO CTS-0102]  Path depth 2 - 2
[INFO CTS-0207]  Dummy loads inserted 3
estimate_parasitics -placement
detailed_placement
[INFO DPL-0006] Core area: 76.52 um^2, Instances area: 35.58 um^2, Utilization: 46.5%
[INFO DPL-0005] Diamond search max displacement: +/- 500 sites horizontally, +/- 100 rows vertically.
[INFO DPL-1101] Legalizing using diamond search.
Movements Summary
---------------------------------------
Total cells:                     305
Diamond Move Success:            305 (100.00%)
Diamond Move Failure:              0
Rip-up and replace Success:        0 (  0.00% of diamond failures)
Rip-up and replace Failure:        0
Total Placement Failures:          0
---------------------------------------
Placement Analysis
---------------------------------
total displacement          3.9 u
average displacement        0.0 u
max displacement            0.5 u
original HPWL             719.7 u
legalized HPWL            742.6 u
delta HPWL                    3 %

estimate_parasitics -placement
repair_timing -setup_margin 0 -hold_margin 0 -repair_tns 100 -verbose
[INFO RSZ-0100] Repair move sequence: UnbufferMove SizeUpMove SwapPinsMove BufferMove CloneMove SplitLoadMove 
[INFO RSZ-0098] No setup violations found
[INFO RSZ-0033] No hold violations found.
detailed_placement
[INFO DPL-0006] Core area: 76.52 um^2, Instances area: 35.58 um^2, Utilization: 46.5%
[INFO DPL-0005] Diamond search max displacement: +/- 500 sites horizontally, +/- 100 rows vertically.
[INFO DPL-1101] Legalizing using diamond search.
Movements Summary
---------------------------------------
Total cells:                     305
Diamond Move Success:            305 (100.00%)
Diamond Move Failure:              0
Rip-up and replace Success:        0 (  0.00% of diamond failures)
Rip-up and replace Failure:        0
Total Placement Failures:          0
---------------------------------------
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL             742.6 u
legalized HPWL            742.6 u
delta HPWL                    0 %

Report metrics stage 4, cts final...

==========================================================================
cts final report_design_area
--------------------------------------------------------------------------
Design area 36 um^2 46% utilization.
write_db ./results/asap7/magic1000/base/4_1_cts.odb
write_sdc -no_timestamp ./results/asap7/magic1000/base/4_cts.sdc
Elapsed time: 0:05.12[h:]min:sec. CPU time: user 4.89 sys 0.48 (104%). Peak memory: 242636KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
4_1_cts                   .odb            5            236 e79fc35bd4645a9a4025
