OpenROAD 26Q2-1619-g9e1904a6f8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
source /opt/OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /opt/OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db ./results/asap7/magic1000/base/5_route.odb
read_sdc ./results/asap7/magic1000/base/5_route.sdc
source /opt/OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
exec cp ./results/asap7/magic1000/base/5_route.odb ./results/asap7/magic1000/base/6_1_fill.odb
Elapsed time: 0:02.48[h:]min:sec. CPU time: user 2.26 sys 0.22 (99%). Peak memory: 199268KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
6_1_fill                  .odb            2            194 b46ffc860d659f33c05a
